// // - створити функцію яка обчислює та повертає площу прямокутника висотою
//
// let a = 10;
// let h = 25;
//
// function triangle(a, h) {
//     let res = (2 / a * h);
//     return res;
//     }
// let res = triangle(a, h);
// console.log(res);

// // - створити функцію яка обчислює та повертає площу кола
//
// let r = 20;
// function roud(r){
//     let res= Math.PI * (r**2);
//     return res;
// }
// let res = roud(r);
// console.log(res);

// - створити функцію яка обчислює та повертає площу циліндру
//
// let r = 15;
// let h = 15;
// let a = 2;
//
// function cylinder(r, h){
//     let res =(Math.PI * r * h) * a; // як описати формулу res= 2ПRH ?
//     return res;
// }
// let res = cylinder(r, h);
// console.log(res);

// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);

// - створити функцію яка  створює блок з текстом. Текст задати через аргумент

// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий

// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)

// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список

