// Зробити свій розпорядок дня.
//
//     У вас має бути більше 10 асинхронних дій з рандомними затримками.
//     Вам необхідно синхронізувати всі свої дії за допомогою промісів та async await
//     (Код має бути написаний окремо)
// Затримка має бути НЕ в порядку зростання, а будь яка.
// При тому ваші дії мають бути синхронізовані.
//
// Прокинутись - 0.3с
// Поснідати - 1с
// Піти в душ - 0.5с
// Дочекатись автобус - 3с
// Доїхати на метро - 0.7с
// Поговорити з подругою - 1с
// Зварити каву - 0.1с
// Посперечатись 0.4с
// Сходити на треню - 2с
// Читати книгу - 0.8с
// Розпланувати бюджет - 1.1с
// Обрати плаття - 0.8с
// Пообідати - 1с
